# Создайте функцию,
# добавьте в неё локальное значение.
# Сделайте так,
# чтобы другая функция принимала это значение
# в качестве параметра.

# def foo():
#     param = 'some param1'
#     return param
#
# def bar(param1):
#     param2 = 'some param2'
#     return param1, param2
#
# print(bar(foo()))




# Написать функцию is_prime,
# принимающую 1 аргумент — число от 0 до 1000,
# и возвращающую True, если оно простое,
# и False - иначе.

import sympy
from sympy import *
print(isprime(int(input('Ведите простое число'))))











