# Даны 2 списка:
# a = [4,6,'pу','tell',78]
# b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# Тебе нужно выполнить следующие операции:
# 1. Сложить два списка
# 2. Добавить элемент 6 на 3 позицию.
# 3. Посчитать сколько раз встречается число 6
# 4. Посчитать количество элементов списка
# 5. Вывести 1 элемент вложенного списка

# a = [4,6,'pу','tell',78]
# b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# a.extend(b)

# a = [4,6,'pу','tell',78]
# a.insert(3,6)
# print(a)

# a = [4,6,'pу','tell',78]
# b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# print(a.count(6))
# print(b.count(6))

# a = [4,6,'pу','tell',78]
# b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# print(len(a))
# print(len(b))

# a = [4,6,'pу','tell',78]
# # b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# print(a[0])