# Создайте словарь person, в котором будут
# присутствовать ключи name, age, city.
# Выведите значение возраста из словаря
# person

# 1 задача
person ={'name':"Yana", 'age': 24, 'city':'Minsk'}

print(person['age'])
